---
kind: property
id: P:Autodesk.Revit.DB.Transform2D.BasisV
source: html/a4dcbe9f-812e-af13-09b6-852be713397f.htm
---
# Autodesk.Revit.DB.Transform2D.BasisV Property

The image of (0, 1) under OfVector(UV) .

## Syntax (C#)
```csharp
public UV BasisV { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null